In [ ]:
Задание 1

In [1]:
import pandas as pd

In [2]:
a = {
    "author_id": [1, 2, 3],
    "author_name": ['Тургенев', 'Чехов', 'Островский']
}

authors = pd.DataFrame(a)

authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [ ]:
Задание 2

In [3]:
b = {
    "author_id": [1, 1, 1, 2, 2, 3, 3],
    "book_title ": ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
    "price": [450, 300, 350, 500, 450, 370, 290]
}

book = pd.DataFrame(b)

book

   author_id           book_title   price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

In [60]:
authors_price = pd.DataFrame(pd.merge(authors, book, on='author_id', how='inner'))
authors_price

   author_id author_name           book_title   price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

In [ ]:
Задание 3

In [32]:
authors_price.sort_values(by="price", inplace=True, ascending=False)
authors_price

   author_id author_name           book_title   price
3          2       Чехов      Толстый и тонкий    500
0          1    Тургенев           Отцы и дети    450
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
2          1    Тургенев     Дворянское гнездо    350
1          1    Тургенев                 Рудин    300
6          3  Островский  Таланты и поклонники    290

In [25]:
authors_price.reset_index(drop=True, inplace=True)
authors_price

   author_id author_name           book_title   price
0          2       Чехов      Толстый и тонкий    500
1          1    Тургенев           Отцы и дети    450
2          2       Чехов       Дама с собачкой    450
3          3  Островский                 Гроза    370
4          1    Тургенев     Дворянское гнездо    350
5          1    Тургенев                 Рудин    300
6          3  Островский  Таланты и поклонники    290

In [55]:
top5 = pd.DataFrame(authors_price[:5])
top5

   author_id author_name        book_title   price
0          1    Тургенев        Отцы и дети    450
1          1    Тургенев              Рудин    300
2          1    Тургенев  Дворянское гнездо    350
3          2       Чехов   Толстый и тонкий    500
4          2       Чехов    Дама с собачкой    450

In [56]:
top5 = pd.DataFrame(authors_price.nlargest(5, "price"))
top5

   author_id author_name        book_title   price
3          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1    Тургенев  Дворянское гнездо    350

In [ ]:
Задание 4

In [ ]:
authors_stat = pd.DataFrame()

In [ ]:
author_name, min_price, max_price и mean_price

In [65]:
groupby = authors_price.groupby("author_name")

In [69]:
groupby["price"].min()

author_name
Островский    290
Тургенев      300
Чехов         450
Name: price, dtype: int64

In [68]:
groupby.agg({"price": "max", "total": "count"})

SpecificationError: nested renamer is not supported